scripts/write throughput/ParaKV-GC/4096.txt
LevelDB:    version 1.23
Date:       Sat Dec 28 11:43:10 2024
CPU:        40 * Intel(R) Xeon(R) CPU E5-2630 v4 @ 2.20GHz
CPUCache:   25600 KB
... finished 100
... finished 200
... finished 300
... finished 400
... finished 500
... finished 600
... finished 700
... finished 800
... finished 900
... finished 1000
... finished 1500
... finished 2000
... finished 2500
... finished 3000
... finished 3500
... finished 4000
... finished 4500
... finished 5000
... finished 6000
... finished 7000
... finished 8000
... finished 9000
... finished 10000
... finished 15000
... finished 20000
... finished 25000
... finished 30000
... finished 35000
... finished 40000
... finished 45000
... finished 50000
... finished 60000
... finished 70000
... finished 80000
... finished 90000
... finished 100000
... finished 150000
... finished 200000
... finished 250000
... finished 300000
... finished 350000
... finished 400000
... finished 450000
... finished 500000
... finished 600000
... finished 700000
... finished 800000
... finished 900000
... finished 1000000
... finished 1100000
... finished 1200000
... finished 1300000
... finished 1400000
... finished 1500000
... finished 1600000
... finished 1700000
... finished 1800000
... finished 1900000
... finished 2000000
... finished 2100000
... finished 2200000
... finished 2300000
... finished 2400000
... finished 2500000
... finished 2600000
... finished 2700000
... finished 2800000
... finished 2900000
... finished 3000000
... finished 3100000
... finished 3200000
... finished 3300000
... finished 3400000
... finished 3500000
... finished 3600000
... finished 3700000
... finished 3800000
... finished 3900000
... finished 4000000
... finished 4100000
... finished 4200000
... finished 4300000
... finished 4400000
... finished 4500000
... finished 4600000
... finished 4700000
... finished 4800000
... finished 4900000
... finished 5000000
... finished 5100000
... finished 5200000
... finished 5300000
... finished 5400000
... finished 5500000
... finished 5600000
... finished 5700000
... finished 5800000
... finished 5900000
... finished 6000000
... finished 6100000
... finished 6200000
... finished 6300000
... finished 6400000
... finished 6500000
... finished 6600000
... finished 6700000
... finished 6800000
... finished 6900000
... finished 7000000
... finished 7100000
... finished 7200000
... finished 7300000
... finished 7400000
... finished 7500000
... finished 7600000
... finished 7700000
... finished 7800000
... finished 7900000
... finished 8000000
... finished 8100000
... finished 8200000
... finished 8300000
... finished 8400000
... finished 8500000
... finished 8600000
... finished 8700000
... finished 8800000
... finished 8900000
... finished 9000000
... finished 9100000
... finished 9200000
... finished 9300000
... finished 9400000
... finished 9500000
... finished 9600000
... finished 9700000
... finished 9800000
... finished 9900000
... finished 10000000
... finished 10100000
... finished 10200000
... finished 10300000
... finished 10400000
... finished 10500000
... finished 10600000
... finished 10700000
... finished 10800000
... finished 10900000
... finished 11000000
... finished 11100000
... finished 11200000
... finished 11300000
... finished 11400000
... finished 11500000
... finished 11600000
... finished 11700000
... finished 11800000
... finished 11900000
... finished 12000000
... finished 12100000
... finished 12200000
... finished 12300000
... finished 12400000
... finished 12500000
... finished 12600000
... finished 12700000
... finished 12800000
... finished 12900000
... finished 13000000
... finished 13100000
... finished 13200000
... finished 13300000
... finished 13400000
... finished 13500000
... finished 13600000
... finished 13700000
... finished 13800000
... finished 13900000
... finished 14000000
... finished 14100000
... finished 14200000
... finished 14300000
... finished 14400000
... finished 14500000
... finished 14600000
... finished 14700000
... finished 14800000
... finished 14900000
... finished 15000000
... finished 15100000
... finished 15200000
... finished 15300000
... finished 15400000
... finished 15500000
... finished 15600000
... finished 15700000
... finished 15800000
... finished 15900000
... finished 16000000
... finished 16100000
... finished 16200000
... finished 16300000
... finished 16400000
... finished 16500000
... finished 16600000
... finished 16700000
... finished 16800000
... finished 16900000
... finished 17000000
... finished 17100000
... finished 17200000
... finished 17300000
... finished 17400000
... finished 17500000
... finished 17600000
... finished 17700000
... finished 17800000
... finished 17900000
... finished 18000000
... finished 18100000
... finished 18200000
... finished 18300000
... finished 18400000
... finished 18500000
... finished 18600000
... finished 18700000
... finished 18800000
Keys:       16 bytes each
Values:     4096 bytes each (2048 bytes after compression)
Entries:    25000000
RawSize:    98037.7 MB (estimated)
FileSize:   49209.6 MB (estimated)
------------------------------------------------
GC is triggered, vlog num: 36, count: 8330
GC is triggered, vlog num: 36, count: 9501
GC is triggered, vlog num: 70, count: 8214
GC is triggered, vlog num: 207, count: 8164
GC is triggered, vlog num: 70, count: 8822
GC is triggered, vlog num: 207, count: 10152
GC is triggered, vlog num: 36, count: 8856
GC is triggered, vlog num: 1, count: 8238
GC is triggered, vlog num: 2, count: 8414
GC is triggered, vlog num: 3, count: 8446
GC is triggered, vlog num: 4, count: 8456
GC is triggered, vlog num: 9, count: 8627
GC is triggered, vlog num: 10, count: 8504
GC is triggered, vlog num: 11, count: 8804
GC is triggered, vlog num: 12, count: 8810
GC is triggered, vlog num: 5, count: 9286
GC is triggered, vlog num: 6, count: 9340
GC is triggered, vlog num: 33, count: 8568
GC is triggered, vlog num: 34, count: 8999
GC is triggered, vlog num: 7, count: 9777
GC is triggered, vlog num: 8, count: 9896
GC is triggered, vlog num: 35, count: 9047
GC is triggered, vlog num: 13, count: 10010
GC is triggered, vlog num: 36, count: 12134
GC is triggered, vlog num: 14, count: 9968
GC is triggered, vlog num: 41, count: 9574
GC is triggered, vlog num: 1, count: 8479
GC is triggered, vlog num: 2, count: 9181
GC is triggered, vlog num: 3, count: 9403
GC is triggered, vlog num: 42, count: 9626
GC is triggered, vlog num: 43, count: 9758
GC is triggered, vlog num: 4, count: 9370
GC is triggered, vlog num: 44, count: 9611
GC is triggered, vlog num: 37, count: 10361
GC is triggered, vlog num: 9, count: 10814
GC is triggered, vlog num: 38, count: 10545
GC is triggered, vlog num: 10, count: 11568
GC is triggered, vlog num: 39, count: 10472
GC is triggered, vlog num: 40, count: 10693
GC is triggered, vlog num: 207, count: 16596
GC is triggered, vlog num: 11, count: 13319
GC is triggered, vlog num: 33, count: 8841
GC is triggered, vlog num: 12, count: 8952
GC is triggered, vlog num: 34, count: 9574
GC is triggered, vlog num: 5, count: 9753
GC is triggered, vlog num: 35, count: 8192
GC is triggered, vlog num: 6, count: 9887
GC is triggered, vlog num: 65, count: 10500
GC is triggered, vlog num: 7, count: 9406
GC is triggered, vlog num: 41, count: 9269
GC is triggered, vlog num: 8, count: 9463
GC is triggered, vlog num: 1, count: 8437
GC is triggered, vlog num: 45, count: 11132
GC is triggered, vlog num: 2, count: 8298
GC is triggered, vlog num: 42, count: 8517
GC is triggered, vlog num: 13, count: 11048
GC is triggered, vlog num: 46, count: 11624
GC is triggered, vlog num: 295, count: 8155
GC is triggered, vlog num: 3, count: 8927
GC is triggered, vlog num: 43, count: 9559
GC is triggered, vlog num: 4, count: 9299
GC is triggered, vlog num: 44, count: 9602
GC is triggered, vlog num: 9, count: 8183
GC is triggered, vlog num: 37, count: 10182
GC is triggered, vlog num: 14, count: 13295
GC is triggered, vlog num: 38, count: 9897
GC is triggered, vlog num: 15, count: 13013
GC is triggered, vlog num: 47, count: 12383
GC is triggered, vlog num: 10, count: 9210
GC is triggered, vlog num: 352, count: 8308
GC is triggered, vlog num: 33, count: 8179
GC is triggered, vlog num: 16, count: 13284
GC is triggered, vlog num: 11, count: 8983
GC is triggered, vlog num: 34, count: 8365
GC is triggered, vlog num: 12, count: 9151
GC is triggered, vlog num: 295, count: 8725
GC is triggered, vlog num: 5, count: 8725
GC is triggered, vlog num: 35, count: 9372
GC is triggered, vlog num: 6, count: 8750
GC is triggered, vlog num: 17, count: 13752
GC is triggered, vlog num: 7, count: 8519
GC is triggered, vlog num: 41, count: 8786
GC is triggered, vlog num: 39, count: 10998
GC is triggered, vlog num: 389, count: 8258
GC is triggered, vlog num: 8, count: 9059
GC is triggered, vlog num: 18, count: 14048
GC is triggered, vlog num: 42, count: 8820
GC is triggered, vlog num: 13, count: 8357
GC is triggered, vlog num: 19, count: 14504
GC is triggered, vlog num: 40, count: 13... finished 18900000
... finished 19000000
... finished 19100000
... finished 19200000
... finished 19300000
... finished 19400000
... finished 19500000
... finished 19600000
... finished 19700000
... finished 19800000
... finished 19900000
... finished 20000000
... finished 20100000
... finished 20200000
... finished 20300000
... finished 20400000
... finished 20500000
... finished 20600000
... finished 20700000
... finished 20800000
... finished 20900000
... finished 21000000
... finished 21100000
... finished 21200000
... finished 21300000
... finished 21400000
... finished 21500000
... finished 21600000
... finished 21700000
... finished 21800000
... finished 21900000
... finished 22000000
... finished 22100000
... finished 22200000
... finished 22300000
... finished 22400000
... finished 22500000
... finished 22600000
... finished 22700000
... finished 22800000
... finished 22900000
... finished 23000000
... finished 23100000
... finished 23200000
... finished 23300000
... finished 23400000
... finished 23500000
... finished 23600000
... finished 23700000
... finished 23800000
... finished 23900000
... finished 24000000
... finished 24100000
... finished 24200000
... finished 24300000
... finished 24400000
... finished 24500000
... finished 24600000
... finished 24700000
... finished 24800000
... finished 24900000
... finished 25000000
048
GC is triggered, vlog num: 20, count: 14440
GC is triggered, vlog num: 257, count: 8194
GC is triggered, vlog num: 258, count: 8338
GC is triggered, vlog num: 259, count: 8480
GC is triggered, vlog num: 260, count: 8536
GC is triggered, vlog num: 265, count: 8641
GC is triggered, vlog num: 266, count: 8728
GC is triggered, vlog num: 267, count: 8718
GC is triggered, vlog num: 268, count: 8775
GC is triggered, vlog num: 261, count: 9293
GC is triggered, vlog num: 262, count: 9199
GC is triggered, vlog num: 289, count: 8602
GC is triggered, vlog num: 290, count: 8705
GC is triggered, vlog num: 291, count: 8894
GC is triggered, vlog num: 292, count: 8793
GC is triggered, vlog num: 263, count: 9752
GC is triggered, vlog num: 264, count: 9658
GC is triggered, vlog num: 297, count: 9301
GC is triggered, vlog num: 298, count: 9067
GC is triggered, vlog num: 299, count: 9321
GC is triggered, vlog num: 300, count: 9059
GC is triggered, vlog num: 257, count: 9717
GC is triggered, vlog num: 293, count: 9744
GC is triggered, vlog num: 258, count: 10358
GC is triggered, vlog num: 294, count: 9898
GC is triggered, vlog num: 295, count: 20040
GC is triggered, vlog num: 296, count: 10192
GC is triggered, vlog num: 301, count: 9994
GC is triggered, vlog num: 36, count: 8225
GC is triggered, vlog num: 259, count: 12531
GC is triggered, vlog num: 302, count: 10058
GC is triggered, vlog num: 260, count: 12306
GC is triggered, vlog num: 289, count: 8846
GC is triggered, vlog num: 265, count: 13060
GC is triggered, vlog num: 290, count: 8394
GC is triggered, vlog num: 266, count: 11100
GC is triggered, vlog num: 267, count: 11694
GC is triggered, vlog num: 291, count: 9391
GC is triggered, vlog num: 268, count: 9505
GC is triggered, vlog num: 292, count: 8547
GC is triggered, vlog num: 261, count: 10610
GC is triggered, vlog num: 297, count: 8256
GC is triggered, vlog num: 321, count: 10317
GC is triggered, vlog num: 262, count: 10990
GC is triggered, vlog num: 298, count: 8710
GC is triggered, vlog num: 263, count: 8899
GC is triggered, vlog num: 264, count: 9479
GC is triggered, vlog num: 299, count: 9760
GC is triggered, vlog num: 269, count: 11998
GC is triggered, vlog num: 300, count: 8627
GC is triggered, vlog num: 257, count: 8440
GC is triggered, vlog num: 293, count: 8413
GC is triggered, vlog num: 270, count: 12238
GC is triggered, vlog num: 294, count: 8956
GC is triggered, vlog num: 258, count: 8322
GC is triggered, vlog num: 296, count: 8879
GC is triggered, vlog num: 14, count: 9112
GC is triggered, vlog num: 301, count: 9667
GC is triggered, vlog num: 271, count: 12503
GC is triggered, vlog num: 303, count: 12100
GC is triggered, vlog num: 304, count: 12155
GC is triggered, vlog num: 289, count: 8175
GC is triggered, vlog num: 259, count: 8845
GC is triggered, vlog num: 290, count: 8469
fillrandom   :       8.425 micros/op 118690 ops/sec 210.632 seconds 25000000 operations;  465.4 MB/s
Microseconds per op:
Count: 25000000  Average: 8.4253  StdDev: 38.08
Min: 4.0000  Median: 7.0826  Max: 83137.0000
Percentiles: P50: 7.08 P75: 8.03 P90: 10.42 P99: 34.92 P99.9: 58.72 P99.99: 199.15
------------------------------------------------------

flush到磁盘: 906MB,		 写入磁盘: 9190MB,		 写放大: 10.14 
原始写入磁盘: 98038MB,		 新写入磁盘量： 94977MB,		 空间放大： 0.97 
marking time: 49331630